# Коли використовувати методи класу, а коли статичні методи?

class Item:
    @staticmethod
    def is_integer():
        '''
        Це має бути щось, що має зв'язок
        з класом, але не те, що повинно бути унікальним
        для кожного екземпляру!
        '''
    @classmethod
    def instantiate_from_something(cls):
        '''
        Це також має бути щось, що пов'язане
        з класом, але зазвичай вони використовуються для
        маніпулювання різними структурами даних для створення екземплярів
        об'єктів
        '''

# ЄДИНА ВІДМІННІСТЬ МІЖ НИМИ:
# статичні методи не передають посилання на об'єкт як перший аргумент у фоновому режимі!

# ПРИМІТКА: Однак, їх також можна викликати з екземплярів.

item1 = Item()
item1.is_integer()
item1.instantiate_from_something()