'''
Впорядкованість. Впорядкований контейнер (колекція) дає можливість звертатися до своїх елементів за індексом (номером) і гарантує, що порядок елементів зберігається.
Змінність. Якщо колекція змінювана, то її вміст можна змінювати, не створюючи нову колекцію. Наприклад, додавати, видаляти, заміняти елементи колекції.
Унікальність. Унікальність стосується вмісту колекції, чи допускається зберігання однакових об'єктів.
'''

'''
Списки (Lists). Впорядковані колекції, які можуть містити елементи будь-якого типу. Списки є змінними, що означає можливість зміни, додавання або видалення елементів після їх створення.
Кортежі (Tuples). Схожі на списки, але вони незмінні. Це означає, що після створення кортежу його не можна змінювати. Кортежі часто використовуються для зберігання даних, які не повинні змінюватися впродовж роботи програми.
Словники (Dictionaries). Колекції пар ключ-значення, де кожний ключ є унікальним. Словники використовуються, коли потрібен швидкий доступ до елементів за ключем.
Множини (Sets). Неупорядковані колекції унікальних елементів. Використовуються для видалення дублікатів і виконання операцій, які типові для математичних множин, таких як об'єднання, перетин, різниця.
Заморожені множини (Frozen Sets). Це незмінні версії множин. Такі множини не можна змінювати після їх створення.
'''