'''
метод toordinal(), який повертає порядковий номер дня, враховуючи кількість днів з 1 січня року 1 нашої ери (тобто з початку християнського календаря). Цей метод перетворює об'єкт datetime в ціле число, що представляє порядковий номер даного дня.
'''

from datetime import datetime

# Створення об'єкта datetime
date = datetime(year=2023, month=12, day=18)

# Отримання порядкового номера
ordinal_number = date.toordinal()
print(f"Порядковий номер дати {date} становить {ordinal_number}")

# Порядковий номер дати 2023-12-18 00:00:00 становить 738872