'''
Охоплювана (Enclosing) область видимості виникає, коли функція визначена всередині іншої функції. Змінні в функції, що охоплює доступні у внутрішній (вкладеній) функції, але не навпаки. Це означає, що внутрішня функція може читати але не змінювати змінні, визначені в функції, що її охоплює.


'''

def outer_func():
    enclosing_var = "Я змінна в функції, що охоплює"

    def inner_func():
        print("Всередині вкладеної функції:", enclosing_var) # Всередині вкладеної функції: Я змінна в функції, що охоплює

    inner_func()

outer_func()
