
x = 50

def func():
    global x
    print('x дорівнює', x)  # x дорівнює 50
    x = 2
    print('Змінюємо глобальне значення x на', x)  # Змінюємо глобальне значення x на 2

func()
print('Значення x складає', x)# Значення x складає 2

'''
x дорівнює 50
Змінюємо глобальне значення x на 2
Значення x складає 2

'''

'''
Для того, щоб змінити глобальну змінну всередині функції, необхідно використовувати ключове слово global. Це вказує Python, що змінна не є локальною, а належить до глобальної області видимості. Без застосування зарезервованого слова global неможливо присвоїти значення змінній, визначеній за межами функції.


'''