'''
Метод count() у списках Python використовується для підрахунку кількості разів, скільки певний елемент зустрічається у списку. Цей метод корисний, коли вам потрібно дізнатися, чи часто і як часто певний елемент присутній у списку. У наступному прикладі ми підрахуємо, скільки чисел 2 зустрічається у списку my_list.


'''

my_list = [1, 2, 3, 4, 2, 2, 5, 2]
count_2 = my_list.count(2)
print(count_2)  # Виведе 4, оскільки число 2 зустрічається 4 рази

count_8 = my_list.count(8)
print(count_8) # 0