'''
Метод sort() у списках Python використовується для сортування елементів списку в порядку зростання або спадання. Цей метод модифікує вихідний список, тобто сортування відбувається "на місці", і він не створює новий відсортований список.

!!!! Пам'ятайте, що метод sort() змінює сам список, на якому він був викликаний. 


'''

nums = [3, 1, 4, 1, 5, 9, 2]
nums.sort()
print(nums)  # Виведе [1, 1, 2, 3, 4, 5, 9]


'''
Якщо потрібно відсортувати елементи в порядку спадання, використовуй аргумент

reverse=True.
'''

nums.sort(reverse=True)
print(nums)  # Виведе [9, 5, 4, 3, 2, 1, 1]

'''
Метод sort() також дозволяє сортувати за ключем, який визначає, як порівнювати елементи. Це може бути корисним, наприклад, при сортуванні списків, які містять вкладені колекції, або коли елементами списку є об'єкти.

'''

words = ["banana", "apple", "cherry"]
words.sort(key=len)
print(words)  # Виведе ['apple', 'banana', 'cherry']
