'''
Список — це впорядкований змінюваний контейнер даних. Списки не диктують розробнику тип даних, який можна помістити в цей контейнер, і можуть містити будь-які типи даних у будь-якому зручному порядку. Це одна з найбільш універсальних і важливих структур даних.
'''

my_list = list()

empty_list = []

my_list = [1, 2, 3, 4, 5]

my_list = [1, "Hello", 3.14]

#================================

'''
У Python синтаксис доступу за індексом виглядає так:
'''
some_iterable = ["a", "b", "c"]
first_letter = some_iterable[0]
middle_one = some_iterable[1]
last_letter = some_iterable[2]


# Змінимо другий елемент списку some_iterable на -2. Другий елемент списку має індекс 1, а отже:

some_iterable[1] = -2
print(some_iterable)

# ['a', -2, 'c']