a = [1, 3, "Hello", True, 10]

for index, item in enumerate(a):
    if item is True:
        a.pop(index)
        break

'''
enumerate(a) повертає послідовність пар, кожна з яких містить індекс елемента та сам елемент зі списку a.

Наприклад, якщо a = [1, 3, "Hello", True, 10], то enumerate(a) створить послідовність:

(0, 1)

(1, 3)

(2, "Hello")

(3, True)

(4, 10)

Це дозволяє нам одночасно отримувати значення (наприклад, item) і його індекс (наприклад, index), що зручно для подальших операцій, таких як видалення елемента.
'''

'''
Оператор is перевіряє, чи є дві змінні одним і тим самим об’єктом у пам'яті. Таким чином, умова if item is True: перевіряє, чи є значення item саме об’єктом True.

Це відрізняється від оператора ==, який лише перевіряє еквівалентність значень. Наприклад, для деякого числа 1, вираз 1 == True повертає True, але 1 is True повертає False, оскільки 1 та True — це різні об'єкти, незважаючи на їх еквівалентність за значенням.
'''