'''
Метод sort() у списках Python використовується для сортування елементів списку в порядку зростання або спадання. Цей метод модифікує вихідний список, тобто сортування відбувається "на місці", і він не створює новий відсортований список.

!!!! Пам'ятайте, що метод sort() змінює сам список, на якому він був викликаний. 


'''

nums = [3, 1, 4, 1, 5, 9, 2]
nums.sort()
print(nums)  # Виведе [1, 1, 2, 3, 4, 5, 9]


'''
Якщо потрібно відсортувати елементи в порядку спадання, використовуй аргумент

reverse=True.
'''

nums.sort(reverse=True)
print(nums)  # Виведе [9, 5, 4, 3, 2, 1, 1]

'''
Метод sort() також дозволяє сортувати за ключем, який визначає, як порівнювати елементи. Це може бути корисним, наприклад, при сортуванні списків, які містять вкладені колекції, або коли елементами списку є об'єкти.

'''

words = ["banana", "apple", "cherry"]
words.sort(key=len)
print(words)  # Виведе ['apple', 'banana', 'cherry']

'''
Пам'ятайте, що метод sort() змінює сам список, на якому він був викликаний. Якщо потрібно зберегти початковий порядок елементів, розгляньте можливість створення копії списку перед сортуванням або використай функцію sorted(), яка повертає новий відсортований список. Також sort() працює тільки зі списками, де всі елементи можуть бути порівняні між собою. Наприклад, спроба відсортувати список, який містить і цифри, і рядки, призведе до помилки.

'''