'''
Константи:


math.pi - константа 
𝜋
π (приблизно 3.14159...);
math.e - константа 
𝑒
e, основа натуральних логарифмів (приблизно 2.71828...);
math.tau - константа 
𝜏
τ, дорівнює 
2
𝜋
2π (приблизно 6.28318...);
math.inf - позначення нескінченності;
math.nan - позначення 'Not a Number' (не число);
'''

'''Функції округлення чисел:



math.ceil(x) - виконує округлення дійсного числа x до найближчого більшого цілого числа;
math.floor(x) - виконує округлення дійсного числа x до найближчого меншого цілого числа;
math.trunc(x) - виконує обрізання дробової частини дійсного числа x, та повертає цілу частину числа;



'''

'''
Тригонометричні функції



math.sin(x) - синус x, де x в радіанах;
math.cos(x) - косинус x;
math.tan(x) - тангенс x;
math.asin(x) - арксинус x;
math.acos(x) - арккосинус x;
math.atan(x) - арктангенс x;
'''


'''
Експоненційні та логарифмічні функції



math.exp(x) - число 
𝑒
e в ступені x;
math.log(x[, base]) - Логарифм x за основою base. Якщо base не вказано, обчислюється натуральний логарифм;


Ступінь та корінь



math.pow(x, y) - x у ступені y;
math.sqrt(x) - квадратний корінь з x;


Деякі інші функції



math.fabs(x) - модуль (абсолютне значення) x;
math.factorial(x) - факторіал числа x;
math.gcd(x, y) - найбільший спільний дільник для x та y;

'''

import math

# Використання констант
print(math.pi)  # Виведе приблизне значення π

# Тригонометрія
angle = math.radians(60)  # Конвертація з градусів у радіани
print(math.sin(angle))  # Синус кута

# Корінь числа
print(math.sqrt(9))  # Квадратний корінь з 9

# Логарифми
print(math.log(10, 2))  # Логарифм 10 за основою 2


#==================================================
from math import pi, sin

sin_pi = sin(pi)