'''

Рівність ==.
Перевіряє, чи рівні значення зліва та справа від оператора. Наприклад, x == y поверне True, якщо x та y мають однакові значення.

Нерівність !=.
Перевіряє, чи не рівні значення зліва та справа від оператора. Наприклад, x != y поверне True, якщо x та y мають різні значення.

Більше > та менше <.
Перевіряють, чи більше або менше значення зліва від значення справа. Наприклад, x > y поверне True, якщо x більше, ніж y.

Більше або дорівнює >= та менше або дорівнює <=. 
Подібно до вищеописаних більше та менше, але включають також можливість рівності. Наприклад, x >= y поверне True, якщо x більше або дорівнює y.
'''