'''

Встановлення додаткових пакетів в Python здійснюється менеджерами пакетів. Стандартний (але не єдиний) менеджер пакетів Python — це pip.

 Пакетний менеджер pip дозволяє легко встановлювати, оновлювати та видаляти бібліотеки. 
 
 https://pypi.org/
'''

# python3 -m pip list

# pip list

'''

pip install requests

Для встановлення останньої версії пакету, на прикладі пакету requests:
'''

'''
pip uninstall requests
Видалення пакету requests:
'''

'''
Список встановлених пакетів з версіями:
pip freeze
'''