'''
Метод random.randrange(start, stop[, step]) повертає випадково вибране число з заданого діапазону.


'''

'''
start - нижня межа діапазону (включно). Це початкове значення, з якого може починатися випадковий вибір. Якщо не вказано, за замовчуванням приймається нуль, і діапазон починається з 0.
stop - верхня межа діапазону (не включно). Це означає, що вибране випадкове число буде меншим, ніж це значення. Цей параметр є обов'язковим, і метод не буде працювати без нього.
step - крок між можливими значеннями. Наприклад, якщо встановити step як 2, метод буде вибирати лише парні числа або числа, кратні 2, в залежності від start. Цей параметр є необов'язковим і за замовчуванням дорівнює 1, що означає, що вибір відбувається з усіх послідовних чисел у діапазоні.
'''

# Тому щоб вибрати випадкове число від 0 до 9:


import random
print(random.randrange(10))  # Верхня межа є 10, але не включається



target = random.randrange(1, 11, 2)
print(f"Ціль: {target}") # Ціль: 3
