'''
Щоб вибрати більше чим один випадковий елемент зі списку, нам необхідний метод random.choices(). Він використовується для генерації випадкової вибірки із послідовності. Цей метод може повернути один або декілька елементів з вказаної послідовності, при цьому дозволяючи повторення елементів у вибірці.


'''

# random.choices(population, weights=None, cum_weights=None, k=1)


'''population - послідовність список, з якої має бути зроблений вибір.
weights - опціональний список, який вказує ймовірності (ваги) кожного елемента в списку population. Ці ваги визначають, наскільки ймовірно, що конкретний елемент буде обраний. Довжина списку weights має бути дорівнювати довжині списку population.
cum_weights - теж опціональний список кумулятивних ваг. Якщо він вказаний, то список weights ігнорується. Кумулятивна вага кожного елемента визначається як сума його ваги плюс ваги всіх попередніх елементів.
k: Кількість елементів для вибору. За замовчуванням k=1.'''


import random

colors = ['червоний', 'зелений', 'синій']
weights = [10, 1, 1]
chosen_color = random.choices(colors, weights, k=1)
print(chosen_color)  # ['червоний']
 