'''
Для впорядкованих контейнерів є спеціальний синтаксис, коли нам необхідно отримати деяку послідовність елементів з контейнера.

послідовність[початок:кінець:крок]


'''

s = "Hello, World!"
first_five = s[:5]
print(first_five)  # Виведе 'Hello'

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
odd_numbers = numbers[0:10:2]

print(odd_numbers) # [1, 3, 5, 7, 9]

odd_numbers = numbers[::2]  # Виведе [1, 3, 5, 7, 9]

even_numbers = numbers[1::2] # Виведе [2, 4, 6, 8, 10]


numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
reverse_numbers = numbers[::-1]
print(reverse_numbers) # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

# ===============================
'''

Щоб зробити копію списку в Python, можна замість методу copy використати зріз з усіма елементами оригінального списку. Зробити це дуже просто — треба створити зріз, який починається з першого елемента і йде до кінця списку. Ось як це виглядає на практиці:

'''
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
copy_numbers = numbers[:]
print(copy_numbers)
