'''Модуль time у Python надає функції для роботи з часом, зокрема з часовими мітками timestamps, паузами виконання для програми, а також іншими часовими операціями.

'''

import time

current_time = time.time()
print(f"Поточний час: {current_time}") # Поточний час: 1721497326.538215

'''
tm_year - рік
tm_mon - місяць від 1 до 12
tm_mday - день місяця від 1 до 31
tm_hour - години від 0 до 23
tm_min - хвилини від 0 до 59
tm_sec - секунди від 0 до 59
tm_wday - день тижня від 0 до 6
tm_yday - день року від 1 до 366
tm_isdst - прапорець літнього часу. 0 означає, що літній час не діє, -1 - інформація відсутня, 1 - літній час діє

'''

'''
time.time(): Повертає поточний час у секундах з 1 січня 1970 року (epoch time).
time.sleep(seconds): Зупиняє виконання програми на вказану кількість секунд.
time.ctime([seconds]): Перетворює часову мітку в текстове представлення, зрозуміле для людини.
time.localtime([seconds]): Перетворює часову мітку в структуру struct_time у місцевій часовій зоні.
time.gmtime([seconds]): Аналогічно localtime, але повертає struct_time у форматі UTC.
time.perf_counter(): Повертає лічильник з високою точністю для вимірювання коротких інтервалів часу. 
'''