'''
Кортежі в Python — це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні. Це означає, що після створення кортежу, не можна змінити його елементи, не можна додавати/видаляти/переставляти елементи. При спробі змінити кортеж, ви отримаєте повідомлення про помилку.

'''

my_tuple = tuple() # або
my_tuple = ()

my_tuple = (1, 2, 3)

# Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому. Це важливо, запам'ятай це! Інакше ви отримаєте змінну, яка просто зберігає елемент кортежу.


my_tuple = (1,)


my_tuple = (1, "Hello", 3.14)

my_tuple = 1, "Hello", 3.14

'''Із операції з кортежами ми маємо фактично тільки доступ до елементів. Ми можемо отримати доступ до елементів кортежу за допомогою індексації.
'''

first_item = my_tuple[0]  # Отримати перший елемент
print(first_item) # 1