'''
Кортежі в Python — це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні. Це означає, що після створення кортежу, не можна змінити його елементи, не можна додавати/видаляти/переставляти елементи. При спробі змінити кортеж, ви отримаєте повідомлення про помилку.

'''

my_tuple = tuple() # або
my_tuple = ()

my_tuple = (1, 2, 3)

# Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому. Це важливо, запам'ятай це! Інакше ви отримаєте змінну, яка просто зберігає елемент кортежу.


my_tuple = (1,)


my_tuple = (1, "Hello", 3.14)

my_tuple = 1, "Hello", 3.14

'''Із операції з кортежами ми маємо фактично тільки доступ до елементів. Ми можемо отримати доступ до елементів кортежу за допомогою індексації.
'''

first_item = my_tuple[0]  # Отримати перший елемент
print(first_item) # 1

# ============================
a = tuple()

a = (1, 2, 4, 55, "jonny")
print(a) # (1, 2, 4, 55, 'jonny')

print(a[-1]) # jonny
print(a[0 : -1]) (1, 2, 4, 55)

"""
💡 Головна різниця між кортежами та списками полягає в їхній незмінності. Кортежі — це чудовий вибір, коли тобі потрібна впорядкована колекція, яка не повинна змінюватися. Списки ж ідеально підходять для випадків, коли тобі потрібна подібна до кортежу структура, але з можливістю модифікації.
"""