''''
Створення віртуального оточення в Python є важливим кроком для розробки проєктів, оскільки це дозволяє ізолювати залежності для кожного проєкту. Це означає, що можна мати різні версії бібліотек для різних проєктів і таким чином уникнути конфліктів залежностей.

☝ Віртуальне оточення - це ізольоване середовище для Python проєктів. Використовуючи віртуальне оточення, можна встановлювати бібліотеки та їхні залежності в межах цього середовища, не впливаючи на глобальне середовище Python або на інші віртуальні оточення.

'''


# https://docs.python.org/3/library/venv.html

# Так само як і pip, venv — це вбудований в Python консольний скрипт.

'''
1. Щоб створити нове віртуальне оточення, виконайте наступні кроки:

Відкрийте термінал або командний рядок.
Перейдіть до директорії, де ви хочете створити свій Python проєкт.
Виконайте наступну команду для створення віртуального оточення:

python3 -m venv .venv 

Це створить директорію .venv у поточній директорії, яка міститиме віртуальне оточення.



'''

'''
2. Щоб почати використовувати Python з віртуального оточення, виконайте активацію віртуального оточення. Для активації віртуального оточення, використовуйте одну з наступних команд, в залежності від вашої системи та командного інтерпретатора:

source .venv/bin/activate

Активує віртуальне середовище та консоль змінить вид на наступний:

(.venv) PS E:\example_joke>
'''


'''
3. Щоб встановити необхідні бібліотеки в межах цього віртуального оточення, використовуйте pip install:

pip install package_name
'''

'''
4. Щоб повернутися до системного Python, виконайте в консолі:

 deactivate

'''

'''
5. Щоб видалити віртуальне оточення, достатньо фізично видалити директорію .venv з усім її вмістом в директорії проєкту.
'''